// необходимо разгарничить события возврата героя в город на региональные и глобальные,
// так же, необходимо подумать над глобальным отображанием передвижением героя для всех игроков
// [TODO]: є можливість додати юзеру героя. який в нього вже є - треба перевірити шо там в БД відбувається
// [TODO]: якщо направити один і той же запит 2 рази підряд - оба запити застосуються. Наприклад: type : "upgradeRegion"
// [TODO]: якщо запустити команду створення нової БД (npm run base) коли основний сервер запущений,  то дані карти, якапередається на фронт - буде не актуальна.
// [TODO]: після створення нового замку, герой який йшов його будувати - не відображається. Треба оновлювати сторінку
// [TODO]: в новому замку, сила армій які захищають регіон не збільшується
// [TODO]: дублювання данних по добутку шахт. region[x][y].sector.work.addValue   та town.storage.sources[mineName].addvalue
