// const dictionary = {
//   general: {
//     lvl: {
//       ru: "уровень"
//     }
//   },
//   // ************ВРЕМЯ*****************
//   date: {
//     time: {
//       ru: "время"
//     },
//     hour: {
//       ru: "час"
//     },
//     day: {
//       ru: "день"
//     },
//     minute: {
//       ru: "минута"
//     },
//     second: {
//       ru: "секунда"
//     }
//   },
//   // ************ДИАЛОГ*****************
//   dialog: {
//     valueUpgrade: {
//       ru: "Стоимость улучшения"
//     },
//     maxLvl: {
//       ru: "Объект достиг максимального уровня"
//     },
//     notResources:{
//       ru: "Не хватает ресурсов"
//     },
//     isUpgrade:{
//       ru: "Действие невозможно - объект в данный момент улучшается",
//     },
//     upgradeDone:{
//       ru: "Начато улучшение объекта"
//     },
//     questions: {
//       upgrade: {
//         ru: "Вы хотите улучшить это здание?"
//       }
//     },
//     answer: {
//       yes: {
//         ru: "да"
//       },
//       no: {
//         ru: "нет"
//       }
//     }
//   },

//   // ****************РЕГИОН*********************
//   region: {},

//   // ****************ШАХТА*********************
//   mine: {
//     type: {
//       gold: {
//         name: {
//           ru: "шахта по добыче золота"
//         }
//       },
//       wood: {
//         name: {
//           ru: "лесопилка"
//         }
//       },
//       ore: {
//         name: {
//           ru: "шахта по добыче руды"
//         }
//       },
//       sulfur: {
//         name: {
//           ru: "шахта по добыче серы"
//         }
//       },
//       crystal: {
//         name: {
//           ru: "шахта по добыче кристалов"
//         }
//       },
//       mercury: {
//         name: {
//           ru: "шахта по добыче ртути"
//         }
//       },
//       gem: {
//         name: {
//           ru: "шахта по добыче драгоценных камней"
//         }
//       }
//     }
//   },
//   // timeLine
//   timeLine:{
//     timeEnd:{
//       ru: "окончание",
//     },
//     upgrade: {
//       ru: "улучшение"
//     },

//   }
// };

// module.exports = dictionary;
