const dictionary = {
	general:{
	lvl:{
		ru:"уровень",
		},
	},
	// ************ВРЕМЯ*****************
	date:{
		time:{
			ru:"время",
		},
		hour:{
			ru:"час",
		},
		day:{
			ru:"день",
		},
		minute:{
			ru:"минута",
		},
		second:{
			ru:"секунда",
		}
	},
// ************ДИАЛОГ*****************
	dialog:{
		valueUpgrade:{
			ru:"Стоимость улучшения",
		},
		questions:{
			upgrade:{
				ru:"Вы хотите улучшить это здание?",
			},
		},
		answer:{
			yes:{
				ru:"да",
			},
			no:{
				ru:"нет",
			},
		},
	},

	// ****************РЕГИОН*********************
	region:{},


// ****************ШАХТА*********************
	mine:{
		type:{
			gold:{
				name:{
					ru:"Шахта по добыче золота",
				}
			},
			wood:{
				name:{
					ru:"Лесопилка",
				}
			},
			ore:{
				name:{
					ru:"Шахта по добыче руды",
				}
			},
			sulfur:{
				name:{
					ru:"Шахта по добыче серы",
				}
			},
			crystal:{
				name:{
					ru:"Шахта по добыче кристалов",
				}
			},
			mercury:{
				name:{
					ru:"Шахта по добыче ртути",
				}
			},
			gem:{
				name:{
					ru:"Шахта по добыче драгоценных камней",
				},
			},
		},
	},		
};